
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УИ_ОбщегоНазначения.ФормаИнструментаПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВыражениеПриИзменении(Элемент)
	ВыражениеПриИзмененииНаСервере();
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоЗначения
&НаКлиенте
Процедура ДеревоЗначенияПередРазворачиванием(Элемент, Строка, Отказ)
	ТекДанные = Элементы.ДеревоЗначения.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПотомковСтроки(ТекДанные.ПолучитьИдентификатор());
	
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПотомковСтроки(ИдентификаторСтроки)
	СтрокаДерева = ДеревоЗначения.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если СтрокаДерева = Неопределено Тогда
		ВозвраТ;
	КонецЕсли;
	Если СтрокаДерева.ЗаполненыПотомки Тогда
		Возврат;
	КонецЕсли;

	ЭлементыСтроки = СтрокаДерева.ПолучитьЭлементы();
	ЭлементыСтроки.Очистить();
	//TODO: Вставить содержимое обработчика
	

	
КонецПроцедуры

&НаСервере
Процедура ВыражениеПриИзмененииНаСервере()
	ВычислитьВыражение(ЭтотОбъект);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВычислитьВыражение(Форма)
	ЭлементыДерева = Форма.ДеревоЗначения.ПолучитьЭлементы();
	ЭлементыДерева.Очистить();
	
#Если Не ТонкийКлиент И Не ВебКлиент Тогда
	УстановитьБезопасныйРежим(Истина);
#КонецЕсли
	Попытка
		Значение = Вычислить(Форма.Выражение);
	Исключение
		УИ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	ОписаниеТипаЗначения = УИ_ТипыПлатформыКлиентСервер.ОписаниеТипаПлатформыПоТипу(ТипЗнч(Значение));
	Если ОписаниеТипаЗначения = Неопределено Тогда
		УИ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить описание типа значения.");
		Значение = Неопределено;
		Возврат;
	КонецЕсли;
	
	КорневаяСтрока = ЭлементыДерева.Добавить();
	КорневаяСтрока.Имя = Форма.Выражение;
	
	КорневаяСтрока.ЗначениеТипЗначенияПредставление = ОписаниеТипаЗначения.Имя;
	КорневаяСтрока.ЗначениеКонтейнер = УИ_ОбщегоНазначения.ЗначениеВКонтейнерДляФормы(Значение);
	КорневаяСтрока.ЗначениеПредставление = КорневаяСтрока.ЗначениеКонтейнер.Представление;
	
	СтрокаПУстышка = КорневаяСтрока.ПолучитьЭлементы().Добавить();
//	СтрокаПУстышка.Имя = "Пустышка";
	
КонецПроцедуры

#КонецОбласти
